app/controllers/pages_controller.rb

SELECT "posts".* FROM "posts"
---
  def home
    @posts = Post.all